---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooLarge
source: html/c991d035-dd20-aeb4-c500-7f10ca5bfc8f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooLarge Property

There are too many points on the selected layers of this dataset to place into the toposolid. Try selecting fewer layers to create the toposolid

## Syntax (C#)
```csharp
public static FailureDefinitionId TooLarge { get; }
```